app/Models/Blog.php

delete from `multiple_category` where `blog_id` = 15
---
          $obj->save();

        // MULTIPLE CATEGORY
          \App\Models\MultipleCategory::where('blog_id',$obj->id)->delete();

delete from `multiple_tag` where `blog_id` = 15
---
          }

        // MULTIPLE TAG
          \App\Models\MultipleTag::where('blog_id',$obj->id)->delete();

select `id`, `slug`, `name` from `blogs` where `id` > 15 limit 1
select `id`, `slug`, `name` from `blogs` where `id` < 15 limit 1
---
    }
    $title = $getBlogDetail->name;
    $allCategory = GET_CATEGORY_BLOG_COUNT();
    $nextPageUrl=self::select('id','slug','name')->where('id','>',$getBlogDetail->id)->first();
    $prevPageUrl=self::select('id','slug','name')->where('id','<',$getBlogDetail->id)->first();